---
kind: method
id: M:Autodesk.Revit.DB.ScheduleField.GetStyle
source: html/9f52cffd-3219-fc71-df91-0302a56cc299.htm
---
# Autodesk.Revit.DB.ScheduleField.GetStyle Method

Gets the style of this field.

## Syntax (C#)
```csharp
public TableCellStyle GetStyle()
```